---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.SetGreen(System.UInt32)
source: html/0c19d5e5-0082-af20-c100-e5ae73748da9.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.SetGreen Method

set green

## Syntax (C#)
```csharp
public void SetGreen(
	uint green
)
```

## Parameters
- **green** (`System.UInt32`) - green

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The value is not valid. The valid range is 0 to 255.